# IMDB Movie Dataset Cleaning

### Import Pandas Library

In [273]:
import pandas as pd

### Read the data file

In [274]:
df = pd.read_csv(r"datasource/imdb_movies.csv", encoding='unicode_escape', low_memory=False)
df.sample(2)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
11448,tt0057016,Duello nel Texas,Duello nel Texas,1963,1963-09-19,"Action, Drama, Romance",97,"Spain, Italy","Spanish, Italian",Ricardo Blasco,"James Donald Prindle, Albert Band",Jolly Film,"Richard Harrison, Giacomo Rossi Stuart, Mikael...",An avenging stranger guns down a gang of ruthl...,5.5,260,NaN,NaN,NaN,NaN,10.0,2.0
13155,tt0061933,Madamigella di Maupin,Madamigella di Maupin,1966,1966-01-08,"Action, Adventure, Romance",95,"Italy, France, Yugoslavia, Spain",French,Mauro Bolognini,"José Gutiérrez Maesso, Théophile Gautier",Jolly Film,"Catherine Spaak, Robert Hossein, Tomas Milian,...",Mlle de Maupin escapes from her uncle's castle...,6.2,137,NaN,NaN,NaN,NaN,2.0,1.0

### Set the column width to maximum to display all the columns

In [275]:
# Display all the columns and rows
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns',None)
df.head(2)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,NaN,Alexander Black,Alexander Black,Alexander Black Photoplays,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,J. and N. Tait,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0

### Analyze the dataset
- Check the data types
- Check the number of records and number of columns

In [276]:
rows, columns = df.shape
print(f"Total Rows present are : {rows}, and total Columns are : {columns}")

Total Rows present are : 85855, and total Columns are : 22

In [277]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85855 entries, 0 to 85854
Data columns (total 22 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_title_id          85855 non-null  object
 1   title                  85855 non-null  object
 2   original_title         85855 non-null  object
 3   year                   85855 non-null  object
 4   date_published         85855 non-null  object
 5   genre                  85855 non-null  object
 6   duration               85855 non-null  int64
 7   country                85791 non-null  object
 8   language               84954 non-null  object
 9   director               85768 non-null  object
 10  writer                 84283 non-null  object
 11  production_company     81400 non-null  object
 12  actors                 85786 non-null  object
 13  description            83740 non-null  object
 14  avg_vote               85855 non-null  float64
 15  votes                  85855 non-null  int64
 16  budget                 23710 non-null  object
 17  usa_gross_income       15326 non-null  object
 18  worlwide_gross_income  31016 non-null  object
 19  metascore              13305 non-null  float64
 20  reviews_from_users     78258 non-null  float64
 21  reviews_from_critics   74058 non-null  float64
dtypes: float64(4), int64(2), object(16)
memory usage: 14.4+ MB

# Data Cleaning Process

### Creating copy of the data

In [278]:
mv = df.copy()
mv.sample(2)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
73946,tt4173614,Ace the Case - Piccola investigatrice a Manhattan,Ace the Case,2016,2016-08-26,"Family, Mystery",94,USA,English,Kevin Kaufman,Kevin Kaufman,Kaufman Films,"Ripley Sobo, Lev Gorn, Susan Sarandon, Marc Me...",After being left at home when her mother goes ...,4.1,455,NaN,NaN,NaN,NaN,22.0,4.0
18147,tt0076574,Providence,Providence,1977,1977-05-13,Drama,110,"Switzerland, France",English,Alain Resnais,David Mercer,Action Films,"Dirk Bogarde, Ellen Burstyn, John Gielgud, Dav...",A dying writer bases his last book on his own ...,7.7,2930,NaN,NaN,NaN,NaN,25.0,19.0

### Column: [imdb_title_id]

In [279]:
mv['imdb_title_id'].unique()

array(['tt0000009', 'tt0000574', 'tt0001892', ..., 'tt9911774',
       'tt9914286', 'tt9914942'], dtype=object)

- We can see that all the values are prefixed with 'tt' which can be removed 
- Also the column name can be renamed to 'id'

In [280]:
# Strip the 'tt' from the imdb_title_id
mv['imdb_title_id'] = mv['imdb_title_id'].str.strip('tt')
mv[['imdb_title_id']].sample(10)

      imdb_title_id
23839       0094969
50364       0821806
1961        0025797
72662       3794204
25729       0101296
59305       1548559
80019       6217724
78147       5606132
16075       0070195
42077       0324071

#### Rename the column to 'imdb_title_id' to 'id'

In [281]:
# Rename column 'imdb_title_id' to 'id'
mv.rename(columns={'imdb_title_id':'id'}, inplace=True)
mv.sample(2)

,id,title,original_title,year,date_published,genre,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
2873,0029754,West of Shanghai,West of Shanghai,1937,1937-10-30,"Adventure, Drama, War",64,USA,English,John Farrow,"Crane Wilbur, Porter Emerson Browne",Warner Bros.,"Boris Karloff, Beverly Roberts, Ricardo Cortez...","Karloff is the Chinese warlord Fang, who holds...",5.9,327,NaN,NaN,NaN,NaN,16.0,13.0
31514,0122657,I piccoli maestri,I piccoli maestri,1998,1998-09-06,"War, Drama",122,Italy,Italian,Daniele Luchetti,"Luigi Meneghello, Sandro Petraglia",Cecchi Gori Group Tiger Cinematografica,"Stefano Accorsi, Stefania Montorsi, Giorgio Pa...",During World War 2 four italian university stu...,6.4,176,NaN,NaN,NaN,NaN,1.0,1.0

#### Convert the column 'imdb_title_id' to integer type

In [282]:
# Convert the column 'imdb_title_id' to integer type
mv['id'] = mv['id'].astype(int)
mv['id'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 85855 entries, 0 to 85854
Series name: id
Non-Null Count  Dtype
--------------  -----
85855 non-null  int64
dtypes: int64(1)
memory usage: 670.9 KB

### Column: [title] and [original_title]

In [283]:
# Check the unique values
df['title'].unique()

array(['Miss Jerry', 'The Story of the Kelly Gang', 'Den sorte drøm', ...,
       'Padmavyuhathile Abhimanyu', 'Sokagin Çocuklari',
       'La vida sense la Sara Amat'], dtype=object)

- The 'title' column does not has any data anomaly and does not require cleaning

In [284]:
# Check the unique values in 'original_title'
df['original_title'].unique()

array(['Miss Jerry', 'The Story of the Kelly Gang', 'Den sorte drøm', ...,
       'Padmavyuhathile Abhimanyu', 'Sokagin Çocuklari',
       'La vida sense la Sara Amat'], dtype=object)

- Both the columns are same and the column 'title' can be dropped

#### Drop the column 'title'

In [285]:
# Drop the column title
mv.drop(columns=['title'],inplace=True)

#### Rename the column 'original_title' to 'title'

In [286]:
# Rename the column 'original_title' to 'title' 
mv.rename(columns={'original_title':'title'}, inplace=True)
mv[['title']].sample(10)

                                  title
74768                            Sahara
67473                       Tanets Deli
28706                    Batman Forever
10798                   A Matter of WHO
57133                              Shut
75483                  No estamos solos
66443                      Speed Dragon
2941                        The Citadel
20110  Quella villa accanto al cimitero
23211                         Goofballs

### Column: [year] and [date_published]
- We can drop the 'year' column
- from the 'date_published' column we will extract the year and further rename the column to 'year'

In [287]:
# Drop the column 'year'
mv.drop(columns=['year'],inplace=True)

#### Extract year from the column 'date_published'

In [288]:
# Convert the column 'published_year' to date_time
mv['date_published'] = mv['date_published'].str[:4]

In [289]:
mv[['date_published']].sample(5)

      date_published
68960           2013
44600           2006
83174           2019
6149            1949
63692           2012

#### Rename the column 'date_published' to 'year'

In [290]:
mv.rename(columns={'date_published': 'year'}, inplace=True)
mv.sample(2)

,id,title,year,genre,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
9732,52218,Some Came Running,1959,"Drama, Romance",137,USA,English,Vincente Minnelli,"James Jones, John Patrick",Sol C. Siegel Productions,"Frank Sinatra, Dean Martin, Shirley MacLaine, ...","Dave Hirsch, a writer and an army veteran wind...",7.4,5541,$ 3151000,NaN,$ 28594,NaN,79.0,40.0
7255,44811,Kvinnors väntan,1960,"Comedy, Drama",107,Sweden,"Swedish, French",Ingmar Bergman,"Ingmar Bergman, Gun Grut",Svensk Filmindustri (SF),"Anita Björk, Eva Dahlbeck, Maj-Britt Nilsson, ...",The four wives of four brothers share stories ...,7.0,2145,NaN,NaN,NaN,NaN,11.0,15.0

### Column: [genre]

In [291]:
mv[['genre']].sample(10)

                            genre
59918    Drama, Mystery, Thriller
61380             Crime, Thriller
57896                      Comedy
33897               Action, Drama
52849              Drama, History
2543        Crime, Drama, Romance
84164             Drama, Thriller
58044                    Thriller
46982  Action, Adventure, Fantasy
80504     Action, Crime, Thriller

#### Genre column contains multiple genres for a single movie, but it must be noted that:
- for each movie we have a maximum of 3 genres
- we can split these multiple genres into three columns 'Genre 1' , 'Genre 2', and 'Genre 3'
- The splitted values can be assigned to the three columns 'Genre 1' , 'Genre 2', and 'Genre 3' respectively

In [292]:
# create a temp df 'genre_split' to store the splitted genres
genre_split  = mv['genre'].str.split(',', expand = True)

In [293]:
# Rename the columns to Genre1, Genre2, Genre3
genre_cols = ['genre1', 'genre2', 'genre3']
genre_split.columns = genre_cols

In [294]:
# Concatenate the split genre df to original df
for i in range(len(genre_cols)):
    mv.insert(loc=mv.columns.get_loc('genre') + 1 + i, column=genre_cols[i], value=genre_split.iloc[:, i])
mv[['genre1','genre2','genre3']].sample(10)

          genre1      genre2     genre3
19883     Action   Adventure     Sci-Fi
56641     Horror    Thriller       None
28445     Action       Crime   Thriller
72107     Sci-Fi        None       None
54135      Drama        None       None
60721     Comedy        None       None
17985     Comedy       Crime       None
69329  Adventure       Drama     Family
40690     Comedy       Drama    Mystery
54768     Action      Comedy       None

In [295]:
# Drop the column genre 
mv.drop(columns=['genre'],inplace=True)
mv.sample(2)

,id,title,year,genre1,genre2,genre3,duration,country,language,director,writer,production_company,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
66867,2385047,Deadliest Prey,2013,Action,Thriller,None,80,USA,English,David A. Prior,David A. Prior,Night Claws Productions,"Ted Prior, Michael Charles Prior, David A. Pri...",Nearly three decades after his abduction by th...,4.5,319,NaN,NaN,NaN,NaN,10.0,17.0
66114,2300783,Amy Winehouse: Fallen Star,2012,Biography,None,None,51,USA,English,Jason Boritz,Rose Berkman,Reagal Films,"Julia Eringer, Josh Mann, Sarah Rochelle, Alai...",A biography on the life of Amy Winehouse.,1.8,151,NaN,NaN,NaN,NaN,3.0,NaN

### Column: [duration]
- the duration column has the run time for the movie in minutes which we will convert to hours

In [296]:
# Check the data type
mv['duration'].dtype

dtype('int64')

In [297]:
mv['duration'].unique()

array([ 45,  70,  53, 100,  68,  60,  85, 120,  55, 121,  54,  96,  61,
        90,  50,  88,  72,  78, 148,  52, 124,  59,  63,  84,  65,  81,
       199,  74,  80,  82,  67,  56, 195,  77,  71,  46, 421, 105,  57,
        58,  73,  64,  62, 163, 300, 116,  69, 125,  97, 138, 112,  91,
        87,  48,  83, 136,  75,  94, 117,  93,  76, 418,  86, 223,  99,
       122, 207, 166,  95,  92,  66, 106, 145, 167,  79, 107, 109, 104,
        89, 102, 150, 131,  47, 119,  98, 110, 143, 137, 128, 101, 183,
       133, 135, 111, 141, 115, 153, 129, 123, 108, 155, 151, 170, 140,
       113, 114, 250, 132, 118, 160, 240, 142, 103, 144,  49, 127, 156,
       130, 165, 147, 152, 226, 227, 231, 218, 200, 210, 225, 243,  51,
       281, 208, 306, 257, 245, 255, 328, 168, 269, 303, 290, 212, 224,
       126, 260, 299, 264, 149, 211, 302, 238, 258, 263, 215, 265, 205,
       237, 220, 285, 293, 267, 216, 241,  43, 134, 184, 261, 197, 244,
       146, 177, 196, 154, 189, 219, 201, 180, 159, 192, 139, 171, 252,
       193, 161, 242, 157, 182, 158, 172, 162, 173, 330, 164, 181, 169,
       174, 179, 209, 178, 190, 228, 175, 186, 188, 191, 176, 185, 234,
       232, 202, 221, 203, 253, 206, 239, 217, 187, 287, 204, 230, 317,
       311, 442, 235, 275, 288, 194, 229, 410, 357, 335, 222, 214, 213,
       271, 298, 439, 198,  41, 729, 345, 233, 580, 323, 315, 247, 366,
       301, 262, 278, 540, 279,  44, 570, 369, 272, 450,  42, 321, 398,
       360, 338, 319, 485, 808, 354])

In [298]:
# Convert the minutes in the duration column to hours
mv['duration'] = (mv['duration']/60).round(2)
mv[['duration']].sample(5)

       duration
50358      1.80
1203       1.13
46505      1.63
66436      0.92
4964       1.92

#### Rename the column to duration(hours)

In [299]:
# Rename the column to duration(hours)
mv.rename(columns={'duration': 'duration(hours)'},inplace=True)
mv[['duration(hours)']].sample(10)

       duration(hours)
74523             1.53
40638             2.33
70660             1.50
11147             3.80
22009             1.80
71969             1.52
37545             1.42
33456             1.80
1865              1.27
2423              1.27